package io.txf4311.arch.eonar.ocr.parser;

public class SnipWordsDic {
    public final static String VELID_WORD_XJ = "新疆省,新疆,";
    public final static String VELID_WORD_ZZ = "自治州,自治县,自治乡,";
    public final static String VELID_WORD_AM = "澳门,";
    public final static String VELID_WORD_LX = "宁夏,宁夏省,";
    public final static String VELID_WORD_GX = "广西省,广西,";
    public final static String VELID_WORD_XZ = "西藏,西藏省,";
    public final static String VELID_WORD_NM = "内蒙古,内蒙古省,";

    public final static String VELID_WORD_ZZQ = ",孟村回族自治县,大厂回族自治县,焉耆回族自治县,白沙黎族自治县,保亭黎族苗族自治县,昌江黎族自治县," +
            "乐东黎族自治县,陵水黎族自治县,琼中黎族苗族自治县,宁洱哈尼族彝族自治县,雨露白族自治乡,东坡傣族自治乡,湾碧傣族傈僳族自治乡,清水土家族自治乡," +
            "克孜勒苏柯尔克孜自治州林场,自治区林业厅玛纳斯平原林场,广西壮族自治区,西藏自治区,内蒙古自治区,新疆维吾尔自治区,宁夏回族自治区,迪庆藏族自治州," +
            "文山壮族苗族自治州,楚雄彝族自治州,西双版纳傣族自治州,大理白族自治州,红河哈尼族彝族自治州,德宏傣族景颇族自治州,怒江傈僳族自治州,琼中黎族苗族自治县," +
            "陵水黎族自治县,乐东黎族自治县,昌江黎族自治县,保亭黎族苗族自治县,白沙黎族自治县,甘孜藏族自治州,凉山彝族自治州,阿坝藏族羌族自治州,克孜勒苏柯尔克孜自治州," +
            "博尔塔拉蒙古自治州,巴音郭楞蒙古自治州,昌吉回族自治州,伊犁哈萨克自治州,黔西南布依族苗族自治州,黔东南苗族侗族自治州,黔南布依族苗族自治州,延边朝鲜族自治州," +
            "临夏回族自治州,甘南藏族自治州,湘西土家族苗族自治州,恩施土家族苗族自治州,玉树藏族自治州,黄南藏族自治州,果洛藏族自治州,海西蒙古族藏族自治州,海南藏族自治州," +
            "海北藏族自治州,海西蒙古族藏族自治州,景东彝族自治县,彭水苗族土家族自治县,";

    public final static String ANVALID_WORD_DIC = "北京市,天津市,石家庄市,唐山市,秦皇岛市,邯郸市,邢台市,保定市,张家口市,承德市,沧州市,廊坊市,衡水市,太原市," +
            "大同市,阳泉市,长治市,晋城市,朔州市,晋中市,运城市,忻州市,临汾市,吕梁市,呼和浩特市,包头市,乌海市,赤峰市,通辽市,鄂尔多斯市,呼伦贝尔市,巴彦淖尔市,乌兰察布市,兴安盟," +
            "锡林郭勒盟,阿拉善盟,沈阳市,大连市,鞍山市,抚顺市,本溪市,丹东市,锦州市,营口市,阜新市,辽阳市,盘锦市,铁岭市,朝阳市,葫芦岛市,长春市,吉林市,四平市,辽源市,通化市,白山市," +
            "松原市,白城市,延边朝鲜族自治州,哈尔滨市,齐齐哈尔市,鸡西市,鹤岗市,双鸭山市,大庆市,伊春市,佳木斯市,七台河市,牡丹江市,黑河市,绥化市,大兴安岭地区,上海市,南京市,无锡市," +
            "徐州市,常州市,苏州市,南通市,连云港市,淮安市,盐城市,扬州市,镇江市,泰州市,宿迁市,杭州市,宁波市,温州市,嘉兴市,湖州市,绍兴市,金华市,衢州市,舟山市,台州市,丽水市," +
            "合肥市,芜湖市,蚌埠市,淮南市,马鞍山市,淮北市,铜陵市,安庆市,黄山市,滁州市,阜阳市,宿州市,六安市,亳州市,池州市,宣城市,福州市,厦门市,莆田市,三明市,泉州市,漳州市," +
            "南平市,龙岩市,宁德市,南昌市,景德镇市,萍乡市,九江市,新余市,鹰潭市,赣州市,吉安市,宜春市,抚州市,上饶市,济南市,青岛市,淄博市,枣庄市,东营市,烟台市,潍坊市,济宁市," +
            "泰安市,威海市,日照市,莱芜市,临沂市,德州市,聊城市,滨州市,菏泽市,郑州市,开封市,洛阳市,平顶山市,安阳市,鹤壁市,新乡市,焦作市,濮阳市,许昌市,漯河市,三门峡市," +
            "南阳市,商丘市,信阳市,周口市,驻马店市,济源市,武汉市,黄石市,十堰市,宜昌市,襄阳市,鄂州市,荆门市,孝感市,荆州市,黄冈市,咸宁市,随州市,恩施土家族苗族自治州," +
            "仙桃市,潜江市,天门市,神农架林区,长沙市,株洲市,湘潭市,衡阳市,邵阳市,岳阳市,常德市,张家界市,益阳市,郴州市,永州市,怀化市,娄底市,湘西土家族苗族自治州," +
            "广州市,韶关市,深圳市,珠海市,汕头市,佛山市,江门市,湛江市,茂名市,肇庆市,惠州市,梅州市,汕尾市,河源市,阳江市,清远市,东莞市,中山市,潮州市,揭阳市,云浮市," +
            "南宁市,柳州市,桂林市,梧州市,北海市,防城港市,钦州市,贵港市,玉林市,百色市,贺州市,河池市,来宾市,崇左市,海口市,三亚市,五指山市,琼海市,儋州市,文昌市,万宁市," +
            "东方市,定安县,屯昌县,澄迈县,临高县,白沙黎族自治县,昌江黎族自治县,乐东黎族自治县,陵水黎族自治县,保亭黎族苗族自治县,琼中黎族苗族自治县,重庆市,成都市,自贡市," +
            "攀枝花市,泸州市,德阳市,绵阳市,广元市,遂宁市,内江市,乐山市,南充市,眉山市,宜宾市,广安市,达州市,雅安市,巴中市,资阳市,阿坝藏族羌族自治州,甘孜藏族自治州," +
            "凉山彝族自治州,贵阳市,六盘水市,遵义市,安顺市,毕节市,铜仁市,黔西南布依族苗族自治州,黔东南苗族侗族自治州,黔南布依族苗族自治州,昆明市,曲靖市,玉溪市,保山市," +
            "昭通市,丽江市,普洱市,临沧市,楚雄彝族自治州,红河哈尼族彝族自治州,文山壮族苗族自治州,西双版纳傣族自治州,大理白族自治州,德宏傣族景颇族自治州,怒江傈僳族自治州," +
            "迪庆藏族自治州,拉萨市,昌都地区,山南地区,日喀则地区,那曲地区,阿里地区,林芝地区,西安市,铜川市,宝鸡市,咸阳市,渭南市,延安市,汉中市,榆林市,安康市,商洛市,兰州市," +
            "嘉峪关市,金昌市,白银市,天水市,武威市,张掖市,平凉市,酒泉市,庆阳市,定西市,陇南市,临夏回族自治州,甘南藏族自治州,西宁市,海东地区,海北藏族自治州,黄南藏族自治州," +
            "海南藏族自治州,果洛藏族自治州,玉树藏族自治州,海西蒙古族藏族自治州,银川市,石嘴山市,吴忠市,固原市,中卫市,乌鲁木齐市,克拉玛依市,吐鲁番地区,哈密地区,昌吉回族自治州," +
            "博尔塔拉蒙古自治州,巴音郭楞蒙古自治州,阿克苏地区,克孜勒苏柯尔克孜自治州,喀什地区,和田地区,伊犁哈萨克自治州,塔城地区,阿勒泰地区,石河子市,阿拉尔市,图木舒克市," +
            "五家渠市,连江县,香港,嘉义市,桃园县,高雄市,金门县,澎湖县,南投县,台中市,新竹县,澳门,台东县,台南市,云林县,花莲县,宜兰县,嘉义县,三沙市,新竹市,台北市,新北市," +
            "苗栗县,基隆市,彰化县,屏东县";

    public final static String SJ_TYPE_WORD = "冁,天津,河北省,山西省,内蒙古自治区,辽宁省,吉林省,黑龙江省,上海,江苏省,浙江省,安徽省,福建省,江西省,山东省,河南省,湖北省,湖南省," +
            "广东省,广西壮族自治区,海南省,重庆,四川省,贵州省,云南省,西藏自治区,陕西省,甘肃省,青海省,宁夏回族自治区,新疆维吾尔自治区,澳门特别行政区,台湾,香港特别行政区,北京,";

    // 需清理的重复字符的中的多余关键字
    public final static String[] CLEAR_KEY_WORD = {"省", "市", "特别行政区", "自治县", "自治区", "自治区", "市辖区", "其它区", "其他区", "区", "镇", "县", "乡", "自治州", "街道办事处", "办事处", "街道", "路", "村"};
    public final static String WRONG_TYPE_DIC = "冁,道白,镇海,镇江,路南,微小,";
    public final static String SPECIL_TYPE_DIC = "冁,省,市,区,镇,县,乡,自治州,自治县,自治区,自治乡,街道,特别行政区,街道办事处,办事处,";
    public final static String ROAD_TYPE_DIC = "冁,路,街,道,大街,小道,大道,中路,国道,省道,乡道,";
    public final static String CONCAT_TYPE_DIC = "冁,期,巷,区,";
    public final static String POSITION_TYPE_DIC = "冁,东,南,西,北,上,中,下,大,小,新,旧,第,";
    public final static String POI_SHORT_DIC = "冁,场,夏,厦,学,心,";
    public final static String NUMBER_TYPE_DIC = "冁,号,栋,座,弄,室,楼,号楼,幢,单元,层,";
    public final static String NUMBER_CHINESE_DIC = ",一,二,三,四,五,六,七,八,九,十,壹,贰,叁,肆,伍,陆,柒,捌,玖,拾,";
    public final static String RELATION_TYPE_WORD_DIC = "冁,和,与,";
    public final static String NOUSE_TYPE_DIC = "冁,自编路,其他区,其它区,市辖区,交汇处,交界处,交叉口,交口,路口,斜对面,附近,中段,周围,旁边,后面,前面,对面,里面,外面,东侧,西侧,南侧,北侧,方向,出口,门口,";
    // 去除"省"关键字后的三字词省级数据
    public final static String PROVINCE_NOKEYWORD = "冁,贵州,山东,江西,广东,山西,甘肃,吉林,河北,湖南,福建,安徽,江苏,海南,青海,陕西,湖北,辽宁,云南,四川,河南,浙江,香港,澳门,";
    public final static String AREA_TYPE_DIC = "冁,市区,校区,湖区,生活村,高新区,开发区,工业园,工业城,工业大夏,工业园区,生活区,创业园,科技园,电脑城,物流园,产业园,地区,市场,广场,工业区,小区,村,山区,";
    public final static String SIGN_TYPE_DIC = "冁,综合楼,办公室,办公楼,研发楼,仓库,购物中心,职业学院,技术学院,工程学院,住宅小区,山区,社区,小区,机场,基地,广场,百货,大厦,大夏,超市,研发楼,汽修厂,"
            + "商城,公寓,花园,公园,医院,职院,中学,酒店,胡同,电源,古镇,学院,车站,别墅,总部,集团,小学,山庄,学校,宾馆,大学,银行,厂房,家园,中心,专柜,物流,门店,园区,半岛,口岸,门诊,"
            + "公司,宿舍,农村,会所,专卖店,加油站,营业部,生活馆,科教城,有限公司,汽配城,便利店,管理处,批发市场,洞,园,阁,苑,店,桥,城,站,院,处,所,厂,社,馆,庙,口,坊,府,岛,湾,庭,塔,队,";
    // 不能被拼接到前面的字符
    public final static String CANTPRE_TYPE_DIC = SPECIL_TYPE_DIC + ROAD_TYPE_DIC + AREA_TYPE_DIC + NUMBER_TYPE_DIC + CONCAT_TYPE_DIC;
    public final static String POI_TYPE_DIC = SPECIL_TYPE_DIC + ROAD_TYPE_DIC + AREA_TYPE_DIC + SIGN_TYPE_DIC + CONCAT_TYPE_DIC;

    // 去除"市"关键字后的三字词市级数据
    public final static String CITY_NOKEYWORD = "冁,杭州,舟山,绍兴,丽水,台州,衢州,嘉兴,金华,温州,宁波,湖州,濮阳,漯河,商丘,洛阳,郑州,焦作,周口,安阳,济源,鹤壁,许昌,信阳,南阳,新乡,开封,资阳,巴中,宜宾,遂宁,南充,自贡,眉山,乐山,雅安,达州," +
            "广安,广元,成都,绵阳,内江,泸州,德阳,曲靖,昭通,临沧,丽江,昆明,保山,玉溪,普洱,辽阳,鞍山,大连,本溪,盘锦,朝阳,锦州,沈阳,铁岭,丹东,抚顺,阜新,营口,鸡西,鹤岗,大庆,黑河,绥化,伊春,仙桃,黄石,潜江,荆州,黄冈,孝感,武汉,咸宁,荆门,天门,宜昌," +
            "随州,襄阳,十堰,鄂州,柳州,梧州,河池,玉林,崇左,南宁,钦州,北海,来宾,桂林,贺州,百色,贵港,商洛,铜川,咸阳,宝鸡,安康,延安,西安,汉中,渭南,榆林,拉萨,西宁,三沙,三亚,定安,儋州,澄迈,屯昌,临高,海口,万宁,文昌,东方,琼海,天津,苏州,镇江,无锡," +
            "南通,宿迁,盐城,徐州,常州,南京,淮安,泰州,扬州,滁州,铜陵,淮南,黄山,宿州,淮北,亳州,宣城,六安,池州,蚌埠,安庆,阜阳,芜湖,合肥,厦门,莆田,漳州,龙岩,南平,泉州,宁德,三明,福州,郴州,娄底,岳阳,衡阳,长沙,益阳,怀化,邵阳,常德,株洲,永州,湘潭," +
            "廊坊,邢台,邯郸,唐山,衡水,承德,保定,沧州,松原,白山,吉林,辽源,白城,通化,四平,长春,白银,陇南,庆阳,金昌,平凉,张掖,武威,天水,兰州,酒泉,定西,临汾,吕梁,忻州,晋城,太原,运城,长治,大同,阳泉,朔州,晋中,通辽,兴安,包头,赤峰,乌海,潮州,中山," +
            "云浮,汕头,东莞,揭阳,汕尾,惠州,珠海,河源,清远,茂名,湛江,佛山,广州,深圳,韶关,梅州,阳江,江门,肇庆,重庆,上海,吴忠,固原,中卫,银川,鹰潭,新余,赣州,抚州,南昌,宜春,萍乡,上饶,吉安,九江,聊城,威海,泰安,济南,日照,东营,菏泽,莱芜,滨州,临沂," +
            "潍坊,烟台,青岛,枣庄,德州,济宁,淄博,贵阳,遵义,毕节,安顺,铜仁,北京,花莲,云林,屏东,台南,彰化,台东,基隆,新竹,苗栗,台中,新北,台北,南投,新竹,澎湖,金门,嘉义,高雄,桃园,嘉义,宜兰,连江,九龙,新界,离岛,平顶山,";

    // 中国百家姓（常用姓）
    public final static String VALID_POPULAR_SURNAME = ",赵,钱,孙,李,周,吴,郑,王,冯,陈,褚,卫,蒋,沈,韩,杨,朱,秦,尤,许,何,吕,施,张,孔,曹,严,华,金,魏,陶,姜,戚,谢,邹,喻,柏,水,窦,章,云,苏,潘,葛,奚,范," +
            "彭,郎,鲁,韦,昌,马,苗,凤,花,方,俞,任,袁,柳,酆,鲍,史,唐,费,廉,岑,薛,雷,贺,倪,汤,滕,殷,罗,毕,郝,邬,安,常,乐,于,时,傅,皮,卞,齐,康,伍,余,元,卜,顾,孟,平,黄,和,穆,萧,尹,姚,邵,湛,汪,祁,毛,禹,狄," +
            "米,贝,明,臧,计,伏,成,戴,谈,宋,茅,庞,熊,纪,舒,屈,项,祝,董,梁,杜,阮,蓝,闵,席,季,麻,强,贾,路,娄,危,江,童,颜,郭,梅,盛,林,刁,钟,徐,邱,骆,高,夏,蔡,田,樊,胡,凌,霍,虞,万,支,柯,昝,管,卢,莫,经,房," +
            "裘,缪,干,解,应,宗,丁,宣,贲,邓,郁,单,杭,洪,包,诸,左,石,崔,吉,钮,龚,程,嵇,邢,滑,裴,陆,荣,翁,荀,羊,於,惠,甄,麴,家,封,芮,羿,储,靳,汲,邴,糜,松,井,段,富,巫,乌,焦,巴,弓,牧,隗,山,谷,车,侯,宓,蓬,全," +
            "郗,班,仰,秋,仲,伊,宫,宁,仇,栾,暴,甘,钭,厉,戎,祖,武,符,刘,景,詹,束,龙,叶,幸,司,韶,郜,黎,蓟,薄,印,宿,白,怀,蒲,邰,从,鄂,索,咸,籍,赖,卓,蔺,屠,蒙,池,乔,阴,欎,胥,能,苍,双,闻,莘,党,翟,谭,贡,劳,逄," +
            "姬,申,扶,堵,冉,宰,郦,雍,舄,璩,桑,桂,濮,牛,寿,通,边,扈,燕,冀,郏,浦,尚,农,温,别,庄,晏,柴,瞿,阎,充,慕,连,茹,习,宦,艾,鱼,容,向,古,易,慎,戈,廖,庾,终,暨,居,衡,步,都,耿,满,弘,匡,国,文,寇,广,禄,阙,东," +
            "殴,殳,沃,利,蔚,越,夔,隆,师,巩,厍,聂,晁,勾,敖,融,冷,訾,辛,阚,那,简,饶,空,曾,毋,沙,乜,养,鞠,须,丰,巢,关,蒯,相,查,後,荆,红,游,竺,权,逯,盖,益,桓,公," +
            "万俟,司马,上官,欧阳,夏侯,诸葛,闻人,东方,赫连,皇甫,尉迟,公羊,澹台,公冶,宗政,濮阳,淳于,单于,太叔,申屠,公孙," +
            "晋,楚,闫,法,汝,鄢,涂,钦,段干,百里,东郭,南门,呼延,归,海,岳,帅,缑,亢,况,后,有,琴,商,牟,佘,佴,伯,赏,墨,哈,谯,笪,年,爱,阳,佟,言,福,百,家,姓,终," +
            "万俟,司马,上官,欧阳,夏侯,诸葛,闻人,东方,赫连,皇甫,尉迟,公羊,澹台,公冶,宗政,濮阳,淳于,单于,太叔,申屠,公孙,仲孙,轩辕,令狐,钟离,宇文,长孙,慕容,鲜于,闾丘,司徒,司空,丌官,司寇,仉督,子车," +
            "颛孙,端木,巫马,公西,漆雕,乐正,壤驷,公良,拓跋,夹谷,宰父,谷梁,晋楚,闫法,汝鄢,涂钦,段干,百里,东郭,南门,呼延,归海,羊舌,微生,岳帅,缑亢,况郈,有琴,梁丘,左丘,东门,西门,商牟,佘佴,伯赏,南宫," +
            "墨哈,谯笪,年爱,阳佟,";

    public final static String KEY_TYPE_WORD = "省,市,区,镇,县,自治州,乡,街道,街";

    // 职位关键字
    public final static String POSITION_WORD = "工程师,Engineer,顾问,Consultant,首席,CEO,CFO,COO,CTO,CIO,CRO,官,officer,总监,总裁,总经理,经理,GM,VP,AVP,HRD,MD,Director,Manager," +
            "组长,副总裁,助理,Operator,操作员,Programmer,程序员,技术员,Administrator,管理员,主管,销售,分析员,实习,会计,文员,Supervisor,部长";
}
